---
kind: method
id: M:Autodesk.Revit.UI.UIApplication.Dispose
source: html/e6297962-5639-88c2-d673-79c8cc030757.htm
---
# Autodesk.Revit.UI.UIApplication.Dispose Method

Releases all resources used by the UIApplication

## Syntax (C#)
```csharp
public void Dispose()
```